# 4头修复版 对比实验baseline
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]

backbone:
  # === RGB ===
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2 RGB P2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 RGB P3
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 RGB P4 (使用标准 C3k2)
  - [-1, 1, SPPF, [512, 5]]               # 7
  # === X ===
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 8-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 9-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 10 X P2
  - [-1, 1, Conv, [256, 3, 2]]            # 11-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 12 X P3
  - [-1, 1, Conv, [512, 3, 2]]            # 13-P4/16
  - [-1, 2, C3k2, [512, True]]            # 14 X P4 (使用标准 C3k2)
  - [-1, 1, SPPF, [512, 5]]               # 15
  # === 融合 (P4) ===
  - [[7, 15], 1, RCSF, [512]]             # 16 融合
  - [-1, 2, C3k2, [1024, True]]           # 17 (使用标准 C3k2)
  - [-1, 1, C2PSA, [1024]]                # 18 (使用标准 C2PSA，无DYT)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 19


  # === P3 侧向精炼 (重点改进) ===
  - [[4, 12], 1, RCSF, [512]]                     # 20 新增：先用 AGF 融合 RGB-P3 和 X-P3
  - [[-1, 19], 1, Concat, [1]]                   # 21 将融合后的 P3 与上采样特征拼接
  - [-1, 2, C3k2, [512, False]]                  # 22

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 23

  # === P2 侧向精炼 (重点改进) ===
  - [[2, 10], 1, RCSF, [256]]                     # 24 新增：先用 AGF 融合 RGB-P2 和 X-P2
  - [[-1, 23], 1, Concat, [1]]                   # 25 将融合后的 P2 与上采样特征拼接
  - [-1, 2, C3k2, [256, False]]                  # 26

  # === 自底向上路径 (维持 Concat 以保证稳定) ===
  - [-1, 1, Conv, [256, 3, 2]]                   # 27
  - [[-1, 22], 1, Concat, [1]]                   # 28 维持 Concat
  - [-1, 2, C3k2, [512, False]]                  # 29

  - [-1, 1, Conv, [512, 3, 2]]                   # 30
  - [[-1, 18], 1, Concat, [1]]                   # 31 维持 Concat
  - [-1, 2, C3k2, [1024, False]]                 # 32

  - [-1, 1, Conv, [1024, 3, 2]]                  # 33
  - [-1, 2, C3k2, [1024, False]]                 # 34

  - [[26, 29, 32, 34], 1, Detect, [nc]]          # 35

